{
	"personal": {
		"ids": [ "name", "profession", "bio" ],
		"name": "Matthew Hansen",
		"profession": "Game Programmer",
		"bio": "Thanks for taking the time to look at my portfolio! I am a professional software engineer with 10+ years of experience architecting high-performance software systems. The majority of my experience is in three areas: the video game industry on 2D and 3D games, DOD contracting on real-time vehicle simulations and maintenance programs, and working with personal clients on emerging technologies including eye-tracking, haptic feedback hardware, and AR/VR applications. My diverse experience has made me an expert at efficiently learning a wide variety of platforms and libraries with a keen eye for thoroughly examining specialized topics."
	},
	"projects": [
		{
			"ids": [ "t_archer", "d_archer", "tag_archer" ],
			"title": "Archer, P.I.",
			"description": "Archer, P.I. is an Augmented Reality app designed to interface directly with the TV show, allowing the player to grab an item from an episode and interact with it. I worked on gameplay puzzles, the user interface, achievement system, data compression and optimization, and native integration between our platform permission systems and engine.",
			"tags": [ "Unity", "C#", "Augmented Reality", "Gameplay", "User Interface", "iOS / Android", "Database", "Achievements" ]
		},
		{
			"ids": [ "t_chan", "d_chan", "tag_chan" ],
			"title": "The Channeler",
			"description": "The Channeler is a PC game that utilizes the Tobii EyeX eye-tracking hardware. We are experimenting with this new technology in games and striving to create a unique and immersive experience. As a part of a team of 12 people, I have worked on AI components for NPC companions and enemies, assisted in engine and tool creation, build automation and installation, general gameplay, prototyping, and analytics.",
			"tags": [ "Unreal Engine 4", "C++", "Blueprint", "Tobii EyeX", "Artificial Intelligence", "Gameplay / Prototyping", "Analytics", "Build Pipeline" ]
		},
		{
			"ids": [ "t_brain", "d_brain", "tag_brain" ],
			"title": "Brain Maxx",
			"description": "Brain Maxx is a game that relies on gathering neurofeedback data in real-time in the form of EEG waves and encourages the player to enter a focused state. The player is initially represented as a small object traveling down a cylindrical space. By monitoring spontaneous electrical activity while engaged in the game, we reward the player when they remain in their focused state by accumulating additional objects that form into a ship. If the player gets either too relaxed or too energized, they will fall out of this reward state. If a player is unable to quickly re-enter a focused state the ship will begin to disintegrate and audio will fade. We hope to gain a better understanding of how games can impact a user's level of focus in real-time and see if repetitive exposure can assist in consciously managing it.",
			"tags": [ "C#", "Unity", "Muse", "EEGer", "Gameplay", "Audio", "Experimental" ]
		},
		{
			"ids": [ "t_engine", "d_engine", "tag_engine" ],
			"title": "Data-Driven Game Engine",
			"description": "As part of my graduate coursework at FIEA, I have been writing a custom game engine from scratch in C++. This includes re-creating fundamental data structures such as a singly-linked list, vector, stack, and hashmap. In addition to compile-time containers, I have been working on creating a script-like system to construct custom data types during run-time. The components that make up this system are datums (to store either individual data or arrays of homogeneous data with Run-Time Type Information support), a scope (which is just as it sounds, it associates other datums and scopes with a name, then encases it), and finally attributed (that links a script-like language to native C++ code). An event-driven XML parsing system is used to assist in the creation of this custom data system at run-time.",
			"tags": [ "C++", "Data Structures", "RTTI", "Data Driven System", "Chain of Responsibility", "XML Parsing", "Factory Pattern" ]
		},
		{
			"ids": [ "t_breakout", "d_breakout", "tag_breakout" ],
			"title": "Motorola 68k Breakout",
			"description": "This version of Breakout was written in Motorola 68000 (32-bit assembly). One of the largest challenges involved optimizing the application to run through a simulator in a Windows environment. Rendering in particular was too slow to be able to redraw bitmaps on the screen even when swapping buffers in a double buffered system. In order to work around this limitation, an invalid rectangle was calculated each frame an entity moved. This allowed the renderer to only re-draw areas of the screen where another sprite was overlapping another sprite or background image on the previous frame. Other challenges included using fixed point notation since the hardware did not support floating point operations, creating a 7-segment LED for the life counter to avoid unnecessarily loading additional sprites and fonts, and maintaining the user input buffer in the cache to ensure the game was responsive to the player’s input.",
			"tags": [ "Assembly", "Motorola 68000", "Low-level Optimization", "Fixed Point" ]
		},
		{
			"ids": [ "t_nyah", "d_nyah", "tag_nyah" ],
			"title": "Nyah",
			"description": "A PC game developed by a team of two. Originally written in C++ and OpenGL, it was later ported to the original Xbox. Some of the more notable technical challenges included converting from OpenGL to DirectX, handling new input devices, and managing requirements for audio and graphic assets across platforms.",
			"tags": [ "C/C++", "Cross Platform", "PC", "Xbox", "OpenGL", "DirectX" ]
		}
	]
}